In [3]:
import pandas as pd

In [4]:
dados = {
    "Nome": ["Isaque", "Leticia", "Ivone"],
    "Idade": [18, 16, 40],
}
df = pd.DataFrame(dados)
df

      Nome  Idade
0   Isaque     18
1  Leticia     16
2    Ivone     40

In [5]:
df.head()

      Nome  Idade
0   Isaque     18
1  Leticia     16
2    Ivone     40

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nome    3 non-null      object
 1   Idade   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [7]:
df.describe()

           Idade
count   3.000000
mean   24.666667
std    13.316656
min    16.000000
25%    17.000000
50%    18.000000
75%    29.000000
max    40.000000

In [8]:
df["Nome"]

0     Isaque
1    Leticia
2      Ivone
Name: Nome, dtype: object

In [9]:
df.loc[0]

Nome     Isaque
Idade        18
Name: 0, dtype: object

In [10]:
df.loc[1]

Nome     Leticia
Idade         16
Name: 1, dtype: object

In [11]:
df.loc[2]

Nome     Ivone
Idade       40
Name: 2, dtype: object

In [12]:
df.iloc[2]

Nome     Ivone
Idade       40
Name: 2, dtype: object